In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import os

In [3]:
datadir = "D:\DataScience-60\AttritionRatePredict"
filename = "Table_1.csv"
filePath  = os.path.join(datadir, filename)
datasets = pd.read_csv(filePath)

In [4]:
datasets.head()

,table id,name,phone number,Location,Emp. Group,Function,Gender,Tenure,Tenure Grp.,Experience (YY.MM),Marital Status,Age in YY.,Hiring Source,Promoted/Non Promoted,Job Role Match,Stay/Left
0,1,sid,9876544345,Pune,B2,Operation,Male,0.00,< =1,6.08,Single,27.12,Direct,Non Promoted,Yes,Left
1,2,sid,9876544345,Noida,B7,Support,Male,0.00,< =1,13.00,Marr.,38.08,Direct,Promoted,No,Stay
2,3,sid,9876544345,Bangalore,B3,Operation,Male,0.01,< =1,16.05,Marr.,36.04,Direct,Promoted,Yes,Stay
3,4,sid,9876544345,Noida,B2,Operation,Male,0.01,< =1,6.06,Marr.,32.07,Direct,Promoted,Yes,Stay
4,5,sid,9876544345,Lucknow,B2,Operation,Male,0.00,< =1,7.00,Marr.,32.05,Direct,Non Promoted,Yes,Stay

In [5]:
datasets.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 902 entries, 0 to 901
Data columns (total 16 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   table id               902 non-null    int64
 1   name                   902 non-null    object
 2   phone number           902 non-null    int64
 3   Location               902 non-null    object
 4   Emp. Group             902 non-null    object
 5   Function               902 non-null    object
 6   Gender                 902 non-null    object
 7   Tenure                 902 non-null    float64
 8   Tenure Grp.            902 non-null    object
 9   Experience (YY.MM)     898 non-null    float64
 10  Marital Status         902 non-null    object
 11  Age in YY.             902 non-null    float64
 12  Hiring Source          902 non-null    object
 13  Promoted/Non Promoted  902 non-null    object
 14  Job Role Match         900 non-null    object
 15  Stay/Left              902 non-null    object
dtypes: float64(3), int64(2), object(11)
memory usage: 112.9+ KB

In [13]:
for col in datasets.columns:
    if datasets[col].dtype == object:
        print(col)

name
Location
Emp. Group
Function
Gender
Tenure Grp.
Marital Status
Hiring Source
Promoted/Non Promoted
Job Role Match
Stay/Left

In [16]:
datasets.shape

(902, 16)

In [15]:
datasets.isnull().sum()

table id                 0
name                     0
phone number             0
Location                 0
Emp. Group               0
Function                 0
Gender                   0
Tenure                   0
Tenure Grp.              0
Experience (YY.MM)       4
Marital Status           0
Age in YY.               0
Hiring Source            0
Promoted/Non Promoted    0
Job Role Match           2
Stay/Left                0
dtype: int64

In [25]:
datasets.value_counts()
for i in datasets.columns:
    if datasets[i].dtype == 'object':
        # print(i, datasets[i].value_counts())
        print(i, len(datasets[i].value_counts()))

name 7
Location 12
Emp. Group 10
Function 3
Gender  3
Tenure Grp. 2
Marital Status 5
Hiring Source 3
Promoted/Non Promoted 2
Job Role Match 2
Stay/Left 2

In [37]:
datasets['Stay/Left'].value_counts()

Stay    596
Left    306
Name: Stay/Left, dtype: int64

In [36]:
datasets['Job Role Match'].value_counts()

Yes    482
No     418
Name: Job Role Match, dtype: int64

In [35]:
datasets['Promoted/Non Promoted'].value_counts()

Promoted        459
Non Promoted    443
Name: Promoted/Non Promoted, dtype: int64

In [33]:
datasets['Hiring Source'].value_counts()

Direct               715
Agency               116
Employee Referral     71
Name: Hiring Source, dtype: int64

In [31]:
datasets['Marital Status'].value_counts()

Single    536
Marr.     356
NTBD        6
Div.        2
Sep.        2
Name: Marital Status, dtype: int64

In [27]:
datasets['name'].value_counts()

Arnab     309
Papu      201
Dwane     154
Shiv      127
shruti     76
sid        19
Rahul      16
Name: name, dtype: int64

In [29]:
datasets['Tenure Grp.'].value_counts()

> 1 & < =3    626
< =1          276
Name: Tenure Grp., dtype: int64

In [38]:
datasets.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 902 entries, 0 to 901
Data columns (total 16 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   table id               902 non-null    int64
 1   name                   902 non-null    object
 2   phone number           902 non-null    int64
 3   Location               902 non-null    object
 4   Emp. Group             902 non-null    object
 5   Function               902 non-null    object
 6   Gender                 902 non-null    object
 7   Tenure                 902 non-null    float64
 8   Tenure Grp.            902 non-null    object
 9   Experience (YY.MM)     898 non-null    float64
 10  Marital Status         902 non-null    object
 11  Age in YY.             902 non-null    float64
 12  Hiring Source          902 non-null    object
 13  Promoted/Non Promoted  902 non-null    object
 14  Job Role Match         900 non-null    object
 15  Stay/Left              902 non-null    object
dtypes: float64(3), int64(2), object(11)
memory usage: 112.9+ KB

In [41]:
datasets['Experience (YY.MM)'].max(),datasets['Experience (YY.MM)'].min(),

(25.08, 0.03)

In [45]:
datasets[datasets['Experience (YY.MM)'] == datasets['Experience (YY.MM)'].max()]

,table id,name,phone number,Location,Emp. Group,Function,Gender,Tenure,Tenure Grp.,Experience (YY.MM),Marital Status,Age in YY.,Hiring Source,Promoted/Non Promoted,Job Role Match,Stay/Left
124,125,Dwane,9876544345,Noida,B5,Operation,Male,0.08,< =1,25.08,Marr.,40.04,Agency,Non Promoted,No,Stay

In [46]:
datasets[datasets['Experience (YY.MM)'] == datasets['Experience (YY.MM)'].min()]

,table id,name,phone number,Location,Emp. Group,Function,Gender,Tenure,Tenure Grp.,Experience (YY.MM),Marital Status,Age in YY.,Hiring Source,Promoted/Non Promoted,Job Role Match,Stay/Left
21,22,shruti,9876544345,Bangalore,B1,Operation,Female,0.03,< =1,0.03,Single,21.05,Direct,Non Promoted,Yes,Stay
894,895,Rahul,9876544345,Vijayawada,B1,Operation,Male,0.03,< =1,0.03,Single,22.05,Direct,Non Promoted,No,Left
895,896,Rahul,9876544345,Vijayawada,B1,Operation,Male,0.03,< =1,0.03,Single,22.06,Direct,Non Promoted,NaN,Stay
896,897,Rahul,9876544345,Vijayawada,B1,Operation,Male,0.03,< =1,0.03,Single,24.06,Direct,Non Promoted,Yes,Stay
897,898,Rahul,9876544345,Vijayawada,B1,Operation,Female,0.03,< =1,0.03,Single,21.09,Direct,Non Promoted,Yes,Stay
898,899,Rahul,9876544345,Vijayawada,B1,Operation,Female,0.03,< =1,0.03,Single,22.02,Direct,Non Promoted,Yes,Left
899,900,Rahul,9876544345,Vijayawada,B1,Operation,Female,0.03,< =1,0.03,Single,22.01,Direct,Non Promoted,NaN,Left
900,901,Rahul,9876544345,Vijayawada,B1,Operation,Female,0.03,< =1,0.03,Single,22.02,Direct,Non Promoted,Yes,Stay